<?php

use Illuminate\Database\Seeder;
use Illuminate\Database\Eloquent\Model;
use App\Models\Article;
use App\Models\Category;
use App\Models\Lang;
use App\Models\User;
use App\Models\Text;

class DatabaseSeeder extends Seeder {

	/**
	 * Run the database seeds.
	 *
	 * @return void
	 */
	public function run()
	{
		Model::unguard();

		// $this->call('UserTableSeeder');
		$this->call('ArticlesSeeder');
        $this->call('CategoriesSeeder');
        $this->call('LangsSeeder');
        $this->call('UsersSeeder');
        $this->call('TextsSeeder');

	}

}

class ArticlesSeeder extends Seeder {

	public function run()
	{
		DB::table('Articles')->delete();
        
		Article::create([
		    'category_id' => 3,
            'title' => 'Історія|История',
            'description' => 'А ПОЧАЛОСЬ ВСЕ ТАК…
Ворохта-селище міського типу Івано-Франківської області України. Розташований у верхів\'ях річки Прут, на північних схилах Лісистих Карпат, поблизу Яблунецького перевалу(850 м). Курорт Ворохта є центром підготовки українських спортсменів зі стрибків з трампліну, біатлонута лижних гонок.
    За легендою, назва селища з\'явилась з XVII століття, коли в селищі поселився утікач з царської армії-солдат Ворохта. Був він талановитим ткачем, слава про нього швидко розійшлася по окрузі. Своєї хати Ворохта не мав. Саме ткацька слава Ворохти спричинилась до слави нового поселення і дала йому назву - село Ворохта. Отже, можна з упевненістю сказати, що наше село отримало остаточну назву в 1598 році.
КОЛІЙНА ДОБА ВОРОХТИ
Вліті 1884 року до Ворохти, буквально крізь гори, пробився перший потяг. Це стало великим дивом для горян. Вони бачили як будувався насип, укладались шини, знали, що в горах пробивали тунелі, мурували кам\'яні мости, та і в самій Ворохті вже були побудовані чотири, чули розповіді про поїзд, але коли він все ж прибув, то збіглися з усіх кутків. Боялися спочатку навіть зайти у вагон. Австрійський уряд вбачав у Карпатах першочергово курортну зону.
    Сюди прибували різноманітні комісії, обстежували довколишню місцевість. Віддавали належне джерелам лікувальних вод безпосередньо у Ворохті, його близьких околицях і дальших—Верховинщини, Закарпаття.
    ПЕРШІ САНАТОРІЇ
Залізниця зі Львова до Ворохти і далі, на Закарпаття, зв\'язала в єдиний ланцюжок курортну смугу від нафтусі Трускавця до мінеральних вод Закарпаття. Перший санаторій у Ворохті для лікування хворих туберкульозом з\'явився в 1906 році, він і носив таку назву: «Перша санаторія». За радянських часів його перейменували у «Гірське повітря». Біля цього санаторію є джерело, воду котрого назвали кам\'янкою. Вона надзвичайно чиста, має добрий смак і є лікувальною.
У Ворохті виникло ще чимало будинків відпочинку, спортових притулків. Приїжджі, котрих у Ворохті ставало щораз більше в усі пори року, винаймали помешкання і на окраїнах. Приїжджали на лікування, відпочинок чи полювання не тільки з Польщі, але і з інших держав Європи.
За річкою Прут навпроти першого санаторію з\'явилася ще одна будова: санаторій Каси хворих. Фінансувало її об\'єднане Товариство каси хворих Станіслава і Дрогобича. Цей санаторій споруджений у 1921 році, був розрахований на 117 ліжок. Збудований був з дерева, але мав гарне архітектурне рішення. На превеликий жаль, ця будівля згоріла під час війни від прямого влучання артилерійського снаряда.
А далі, говорячи про санаторно-відпочинкові об\'єкти Ворохти, треба згадати про будинок відпочинку Товариства польських урядовців «Скарбівка» на 180 ліжок. Споруджений на горбочку навпроти польського костелу. Дерев\'яний, покритий черепицею. Як вліті, так і взимі там завжди було повно панства, як говорили того часу. «Скарбівкою» управляв пан Маєвський, поляк, але був він не гоноровий і мав добрий характер. Чорнявий, високого зросту. У ті часи легкових машин тут не було, то пан мав маленького сивого коника і малий фіакр на дві особи. Пан сам собі фірманив і доглядав за тим коником. Упряж мав дуже гарну, вироблену косівськими спеціалістами. Взимі їздив маленькою залубнею, а на шиї коника був цілий пас шелестів (шелести - це дзвіночки закритої форми).
ЗАСНУВАННЯ ХРИСТИЯНСТВА У ВОРОХТІ
До 1780 року Ворохта не мала своєї церкви. Лише на роздоріжжі, де дорога повертає до Вороненки. біля нинішнього Народного дому, в 1602 році була освячена богослужебна каплиця. Ця каплиця була знищена; потім, за часів Австро-Угорщини, відновлена у зменшеному вигляді, як пам\'ятка, а вдруге її знищили за радянських часів у 1940 році.
    У 1779 році онук сина засновника селища Михайла Ворохти Іван одружився з внучкою засновника Вороненки Івана Воронюка Євдокією, то останній дав вороненківську церкву внучці у віно. Цю церкву перевезли у Ворохту. Так у Ворохті виникла перша церква.
    Наприкінці 20-х років у Ворохті будували нову велику церкву. В 1930-му із старої перенесли в нову всі цінності, в тім числі і дзвіницю з трьома дзвонами. Стара церква опустіла. Під час Другої світової війни угорці зробили з неї конюшню. Коні все погризли всередині, зовнішні стіни також потрухлявіли, огорожа впала. Історична церква стала пусткою. Ключ від цієї церкви знаходився у голови сільради, бо йшла мова про перетворення її в музей атеїзму. Частина віруючих не раз зверталась до громади діючої церкви, до пароха Чернявського з пропозицією полагодити стару, замінити хоча б старовинний хрест, котрий похилився і ледь тримався, але її ніхто не підтримував.
    Друга церква селища Ворохта має назву Петра і Павла. Потреба у її побудові назріла, коли збільшилось населення в селищі. Першим питанням стояло будівництво церкви і дому «Просвіти», бо для «Просвіти» була відведена тільки одна кімната при учительській оселі.
    Дуже багато було роботи на розкопуванні площадки під будову, бо місцина хоч гарна, але була тоді нерівна. За цю роботу взялась переважно молодь і до зими все було зроблено. Зібрали знову нараду із згаданих вище керівників, церковні браття запросили на неї будівничих майстрів, котрі в основному спеціалізувались на будівництві церков На цій нараді затвердили проект церкви і погодилися на оплаті за роботу. Будівництво почалося в 1928 році і тривало два роки. Церква вибудувалась велика, покрита бляхою шаховим порядком, з чотирма куполами /банями/ по краях і великою банею посередині. Поставили дзвіницю з трьома дзвонами. Коли всі роботи було закінчено, а це 193 0 рік. церковні браття звернулись до Єпископа Одинарія Станіславської греко-католицької Єпархії Григорія Хомишина. щоб приїхав подивитися церкву і призначив посвяту Під час оглядин владика Хомишин не погодився з громадою, бо церква має п\'ять куполів, атака архітектура властива православній Церкві і поставив умову зняти два куполи. Інакше він відмовлявся висвячувати. Громада Ворохти запротестувала проти вимог владики Хомишина і звернулася до Львівської Митрополії з поясненнями. Львів прислав Правата, котрий посвятив церкву літньої пори 1930 року.
ЗАРОДЖЕННЯ ОСВІТИ
З прокладенням залізниці горяни Ворохти та навколишніх сіл потягнулися до освіти. У Ворохті в 1906 році Львівський народний інститут побудував учительську оселю, директором якої став пан Івантишин. При оселі діяли кімнати відпочинку на 50 ліжок, одна кімната “Просвіти” і однокласна школа.
Потім, за часів другої окупації Польщею Західної України у 20-30-х роках, вже існувала школа повшехна. Це була польська школа, де вчилися польські і жидівські діти, 6-класова школа, а в руській, як тоді називали - чотири класи. Ще була платна рідна школа, також чотирикласна. Якщо хтось хотів одержати середню освіту, то треба було закінчити чотири класи руської школи, перейти до польської закінчувати п\'ятий і шостий класи, а вже тоді можна було переходити до рідної платної і закінчувати ще чотири класи. Це вдавалося не багатьом.
    ХЛІБОРОБСЬКИЙ ВИШКІЛ МОЛОДІ
З 1937 по 1939 роки у Ворохті існував хліборобський вишкіл молоді. Навчання відбувалося у вівторок та суботу ввечері. Навчання вели так шані «передовики».
    Програма навчання була така: перша година - агротехніка вирощування буряків, капусти та різної ярини; друга година - садоводство га пасічництво; третя година - політзаняття. Були і зміни в годинах навчання: співи, танці. Гуртків було багато в читальні “Просвіти”: співу, танцю, драматичний, гурток відродження і спорту, так що Ворохта пішла на великий розвиток, про що будемо продовжувати далі.
    Ще хочу повернутися до освіти 1900 року. Як вже згадував, у 1906 році була побудована Учительська оселя, де був директором пан Івантишин, але директор мав свої заняття, котрі стосувалися оселі. Він не був педагогом, а директором будинку відпочинку для наших українських учителів, одним словом це можна назвати згромадженням, що знаходилося в одному будинку. В кінці 1908 року директор Львівського педінституту направив до Ворохти до помочі директору молодого народного учителя. Він став першим учителем нашої Ворохти. Лев Швак, гак називали його, народний учитель.
    Лев Швак народився 3 березня 1883 року вДолині. Цей юнак був дуже прихильний не лише до дітвори, але взагалі і до народу. На превеликий жаль, не довелось йому довго вчителювати.
    СПОРТ
За австрійських часів спорт не дуже розвивався, бо великі кошти вкладали в курорти. Почав розвиватися з 1925 року, за часів Польщі. Цього року у Ворохті побудували будинок Товариства «Приятелі Гуцульщини» (він згорів під час війни, тепер на цьому місці інша будівля). У це Товариство входили наші гуцули і польські гуралі з польських Татрів, «нарцяжи» (по-українському лищетарі. або лижники) з польської столиці лижного спорту Закопане. У Ворохті вони побудували таку ж скочню (трамплін), як і в Закопаному. У 1930 році були готові вже дві. велика і дитяча. Вони набули міжнародного значення. Проводились лижні гонки, так звані бригадні, по 5 чоловіку бригаді. Дистанція - 150 км, з 10-кілограмовим заплечником і карабіном. Наша бригада виступала під номером 29. Найкращими гонщиками були Хомин Федір, Семанюк Лукин, Никорак Іван, Дуцько Хомин. Але найвидовищнішими були змагання на скочні. Сюди приїжджали знані польські спортсмени Лянкуш і Марусаж, з наших ворохтян відзначалися Дедерчук Макар /Цьвиків/, Бойчук Микола /Подирейської/, Лупаца Мілько. Товариство «Приятелі Гуцульщини» організувало змагання щорічно, запрошувало спортсменів з Норвегії, Німеччини, Чехословаччини, Фінляндії та інших країн, так що Ворохта була наповнена гостями цілу зиму. За радянських часів побудували спортбазу з лижного спорту «Україна», а на трампліні «Авангард» - будинок відпочинку для спортсменів. ТУРИЗМ у Карпатах - заняття унікальне. Особливо, коли за відправну точку обрати Ворохту. Вийдеш на гірку Ясень, що на дільниці Шимшорів (вул.Шевченка), поглянеш довкола - і вибирай маршрут. Звідси видно гори Кичеру, Кукул, Костричу. Ріжу, Ребровач. Лисину; на півночі - Магуру, Кітилівку, Сліпо-куру, Говерлу, Форесок; на північному заході - Хом\'як, Синяк. Горган та чимало інших живописних вершин. Біля підніжжя Говерли на полонині Заросляк діє однойменна туристична база.
ПЕРШІ ПРОМИСЛОВІ ОБ\'ЄКТИ ВОРОХТИ
Австрія доклала багато зусиль і коштів для побудови у складних гірських умовах залізниці, дбаючи першочергово про облаштування курортної зони у Ворохті. Але мала на меті і лісорозробку, враховуючи потужні неторкані лісові запаси Ворохти і околиць. Адже Прикарпаття було багате на різні деревні породи: граб, дуб, явір, ясен, береза, не кажучи про смерекові, ялицеві та букові праліси. Досить сказати, що окремі дерева давали до ЗО кубометрів ділової деревини. У 1910 році австрійський уряд побудував у Ворохті невеликий розпиловочний цех на дві пилорами. Спочатку ліс підвозили кіньми взимі, бо рубка тривала чотири місяці: листопад, грудень, січень, лютий. Згодом побудували вузькоколійку на сім кілометрів. Два маленькі паровози, котрі працювали на букових дровах, тягали спеціальні візочки /льори/ для перевезення лісу. На одну льору вміщалося до десяти кубів. Завантажували деревину на сьомому кілометрі, на Аргелуші, так що з Аргелуші сім кілометрів до пилорами візки котилися згори самокотом, лише на гальмах стояв бринзарь. Вантажили ліс вручну, спершу на миглу /естакаду/, до котрої возили його кіньми, а вже з мигли перевантажували на льори, теж вручну. Ця колійка мала і пасажирські вагончики, які називали сальонками. Ними їздили робітники та туристи. Тепер повернемося до пилорам. Ці дві пилорами були під накриттям, під рамою була яма для збору пилиння (тирси), котру звідти вибирали у великі ящики і носили, як тоді говорили, до гайцу (котельні), котра гнала парову машину у вигляді паровоза без коліс з електричним генератором. Генератор давав струм на цілий фірес (тартак). Цей тартак був державний. Ще один тартак на одну пилораму розміщувався недалеко від державного, за дорогою над річкою Прут. Власником цього тартака був жид Ара. Світло на нього він брав з державного. Отже, з\'явилася робота. Але місцевим гуцулам гордість за свій край не дозволяла іти на роботу під чужоземний примус. Тих, хто ішов на роботу на тартак, зневажливо називали бараба фірисовий. Тому на робот}\' в Ворохту наїхало багато чужих людей.
    Місцевий люд займався традиційним промислом: ткацтвом, кушнірством, вишиванням кептарів, кожухів, петек, виготовляв драниці Для покриття хат (одно- і двометрові), ґонту. На цім промислі славились майстри з Яблуниці Петро та Микола Капітанчуки. З\'явилися власні будівничі майстри, столяри, різьбярі, токарі. А в розпилюванні лісу дотримувалися давніх трацьких традицій. Хочу зупинитися на самому процесі ручного розпилювання лісу.У землю закопували два стовпи висотою два метри з інтервалом чотири. На верху стовпів кріпили сволок і дві пільги, по яких викочували кругляк до самого сволока. Знизу на сволок підкладали два клини, щоб кругляк лягав строго горизонтально. Відбивали шнуром мітку. Трацькі пили були різної довжини: 130,150 і 200 см. Ліс після рубки відразу керували, а вже потім зганяли донизу, до ракаша. Коли заженуть ліс до ракаша, там проходить рихта, це коли четверо людей цапінами та гріфами закладають цуги (з коней чи волів) і везуть на призначене місце. Коней підковували на гострі підкови. Волам теж прибивали підкови у формі півмісяця на чотири цвяхи по краях на крайні паперки. Передній край підкови підгинали вгору, до паперка, а задній - вниз, до землі. Ковані чотирирічні воли могли тягнути десять кубів лісу зараз. Ворохта - гірське селище міського типу з 1960 року, розташоване на висоті 850 метрів над рівнем моря, вздовж ріки Прут, однієї з найвисотніших рік Карпат. Населення Ворохти складає понад 5 тисяч жителів. Через селище проходить залізниця Івано-Франківськ - Рахів. Клімат Ворохти середньогірський, з помірно холодною зимою та прохолодним літом. Знижений атмосферний тиск, насиченістю ультрафіолетовим промінням при достатній кількості озону в повітрі, насиченість фітоцидами сприяють лікуванню туберкульозних захворювань. Селище стало відомою здравницею.|А НАЧИНАЛОСЬ ВСЕ ТАК…
                Ворохта-поселок городского типа Ивано-Франковской области Украины. Расположен в верховьях реки Прут, на северных склонах Лесистых Карпат, близ Яблунецкого перевала (850 м). Курорт Ворохта является центром подготовки украинских спортсменов по прыжкам с трамплина, биатлонута лыжным гонкам.
                По легенде, название поселка появилось с XVII века, когда в поселке поселился беглец из царской армии - солдат Ворохта. Был он талантливым ткачом, слава о нем быстро разошлась по округе. Своего дома Ворохта не имел. Именно ткацкая слава Ворохты обусловилась к славе нового поселения и дала ему название - село Ворохта. Итак, можно с уверенностью сказать, что наше село получило окончательное название в 1598 году.
                ВРЕМЯ ВОРОХТЫ
                Влити 1884 до Ворохты, буквально через горы, пробился первый поезд. Это стало большим чудом для горцев. Они видели как строился насыпь, заключались шины, знали, что в горах пробивали тоннели, возводили каменные мосты, да и в самой Ворохте уже были построены четыре, слышали рассказы о поезде, но когда он все же прибыл, совпали со всех уголков . Боялись сначала даже зайти в вагон.
                Австрийское правительство видело в Карпатах первую курортную зону. Сюда прибывали различные комиссии, обследовавшие близлежащую местность. Отдавали должное источникам лечебных вод непосредственно в Ворохте, его близких окрестностях и дальнейшей-Верховинщины, Закарпатья.
                ПЕРВЫЕ САНАТОРИИ
                Железная из Львова в Ворохты и дальше, на Закарпатье, связала в единую цепочку курортную полосу от Нафтуси Трускавца до минеральных вод Закарпатья. Первый санаторий в Ворохте для лечения больных туберкулезом появился в 1906 году, он и носил такое название: «Первая санатория». В советское время его переименовали в «Горный воздух». У этого санатория есть источник, воду которого назвали каменкой. Она чрезвычайно чистая, имеет хороший вкус и является лечебной.
                В Ворохте возникло еще немало домов отдыха, спортовы приютов. Приезжие, которых в Ворохте становилось все больше во все времена года, снимали квартиру и на окраинах. Приезжали на лечение, отдых или охоту не только из Польши, но и из других государств Европы.
                За рекой Прут напротив первого санатория появилась еще одно строение: санаторий Кассы больных. Финансировало ее объединенное Общество кассы больных Станислава и Дрогобыча. Этот санаторий построен в 1921 году, был рассчитан на 117 коек. Построен был из дерева, но имел хорошее архитектурное решение. К большому сожалению, это здание сгорело во время войны от прямого попадания артиллерийского снаряда.
                А дальше, говоря о санаторно-туристические объекты Ворохты, нужно вспомнить о доме отдыха Общества польских чиновников «Скарбивка» на 180 коек. Построенный на пригорке напротив польского костела. Деревянный, покрытый черепицей. Как влет, так и зимой там всегда было полно господ, как говорили того времени. «Скарбивкою» управлял господин Маевский, поляк, но был он не гоноровый и имел хороший характер. Чернявый, высокого роста. В те времена легковых машин здесь не было, то господин имел маленького седого конька и малый фиакр на два лица. Господин сам себе фирманив и присматривал за тем коньком. Упряжь имел очень хорошую, произведенную косовскими специалистами. Зимой ездил маленькой залубнею, а на шее коня был целый пас шелестел (шелести - это колокольчики закрытой формы).
                ОСНОВАНИЯ ХРИСТИАНСТВА В ВОРОХТЕ
                До 1780 года Ворохта не имела своей церкви. Только на перепутье, где дорога поворачивает к Вороненко. возле нынешнего Народного дома, в 1602 году была освящена богослужебные часовня. Эта часовня была уничтожена, затем, во времена Австро-Венгрии, восстановленная в уменьшенном виде, как памятник, а второй ее уничтожили в советское время в 1940 году.
                В 1779 году внук сына основателя поселка Михаила Ворохты Иван женился на внучке основателя Вороненко Ивана Воронюка Евдокией, то последний дал вороненкивську церковь внучке в приданое. Эта церковь перевезли в Ворохту. Так в Ворохте возникла первая церковь.
                В конце 20-х годов в Ворохте строили новую большую церковь. В 1930-м из старой перенесли в новую все ценности, в том числе и колокольню с тремя колоколами. Старая церковь опустела. Во время Второй мировой войны венгры сделали из нее конюшню. Лошади все погрызли внутри, наружные стены также рассыпавшиеся, ограждение упала. Историческая церковь стала пустой. Ключ от этой церкви находился у председателя сельсовета, потому шла речь о превращении ее в музей атеизма. Часть верующих не раз обращалась к обществу действующей церкви, в священника Чернявского с предложением починить старую, заменить хотя бы старинный крест, который наклонился и едва держался, но ее никто не поддерживал.
                Вторая церковь поселка Ворохта называется Петра и Павла. Потребность в ее построении назрела, когда население в поселке. Первым вопросом стояло строительство церкви и дома «Просвиты», поскольку для «Просвещения» была отведена только одна комната при учительской жилища.
                Очень много было работы на раскапывании площадки под строительство, потому что место хоть красивая, но была тогда неровная. За эту работу взялась преимущественно молодежь и к зиме все было сделано. Собрали снова совещание из упомянутых выше руководителей, церковные братья пригласили на нее строительных мастеров, в основном специализировались на строительстве церквей На этом совещании утвердили проект церкви и согласились на оплате за работу. Строительство началось в 1928 году и продолжалось два года. Церковь выстроилась большая, покрытая жестью шахматным порядком, с четырьмя куполами / куполами / по краям и большим куполом посередине. Поставили колокольню с тремя колоколами. Когда все работы были закончены, а это 193 0 год. церковные братья обратились к Епископа Одинария Станиславской греко-католической епархии Григория Хомышина. чтобы приехал посмотреть церковь и назначил посвящение Во время осмотра владыка Хомишин не согласился с общиной, потому что церковь имеет пять куполов, атака архитектура свойственна православной Церкви и поставил условие снять два купола. Иначе он отказывался рукополагать. Община Ворохты запротестовала против требований владыки Хомышина и обратилась во Львовский Митрополии с пояснениями. Львов прислал Правати, который посвятил церковь летнее время 1930 года.
                ЗАРОЖДЕНИЕ ОБРАЗОВАНИЯ
                З прокладенням залізниці горяни Ворохти та навколишніх сіл потягнулися до освіти. У Ворохті в 1906 році Львівський народний інститут побудував учительську оселю, директором якої став пан Івантишин. При оселі діяли кімнати відпочинку на 50 ліжок, одна кімната “Просвіти” і однокласна школа.
                С прокладкой железной горцы Ворохты и близлежащих сел потянулись к образованию. В Ворохте в 1906 году Львовский народный институт построил учительскую жилище, директором которой стал господин Ивантишин. При доме действовали комнаты отдыха на 50 мест, одна комната "Просвиты" и одноклассная школа.
                Затем, во времена второй оккупации Польшей Западной Украины в 20-30-х годах, уже существовала школа повшехны. Это была польская школа, где учились польские и еврейские дети, 6-классовая школа, а в русской, как тогда называли - четыре класса. Еще была платная родная школа, также четырехклассная. Если кто хотел получить среднее образование, то надо было закончить четыре класса русской школы, перейти к польской заканчивать пятый и шестой классы, а уже тогда можно было переходить к родной платной и заканчивать еще четыре класса. Это удавалось не многим.
                ЗЕМЛЕДЕЛЬЧЕСКАЯ ВЫУЧКА МОЛОДЕЖИ
                С 1937 по 1939 годы в Ворохте существовал крестьянский выучку молодежи. Обучении во вторник и субботу вечером. Обучение вели так почете «передовики».
                Программа обучения была такова: первый час - агротехника выращивания свеклы, капусты и разной овощи; два часа - садоводство га пчеловодства; третий час - политзанятия. Были и изменения в часах обучения: пение, танцы. Кружков было много в читальне "Просвиты": пения, танца, драматический, кружок возрождения и спорта, так что Ворохта пошла на большое развитие, о чем будем продолжать дальше.
                Еще хочу вернуться к образованию 1900 года. Как уже упоминал, в 1906 году была построена Учительская жилище, где был директором господин Ивантишин, но директор имел свои занятия, которые касались жилья. Он не был педагогом, а директором дома отдыха для наших украинских учителей, одним словом это можно назвать конгрегации, что находилось в одном здании. В конце 1908 года директор Львовского пединститута направил в Ворохту в помощь директору молодого народного учителя. Он стал первым учителем нашей Ворохты. Лев ШВАК, гак называли его, народный учитель.
                Лев ШВАК родился 3 марта 1883 вниз. Этот юноша был очень благосклонен не только к детишкам, но вообще и к народу. К большому сожалению, не пришлось ему долго учительствовать.
                СПОРТ
                В австрийские времена спорт не очень развивался, поскольку большие средства вкладывались в курорты. Начал развиваться с 1925 года, во времена Польши. В этом году в Ворохте построили дом Общества «Друзья Гуцульщины» (он сгорел во время войны, теперь на этом месте другое здание). В это Общество входили наши гуцулы и польские гурали из польских Татр, «нарцяжы» (по-украинский лищетари ... или лыжники) из польской столицы лыжного спорта Закопане. В Ворохте они построили такую же скочню (трамплин), как и в Закопане. В 1930 году были готовы уже две. большая и детская. Они приобрели международное значение. Проводились лыжные гонки, так называемые бригадные, по 5 мужчине бригаде. Дистанция - 150 км, с 10-килограммовым заплечником и карабином. Наша бригада выступала под номером 29. Лучшими гонщиками были Хомин Федор, Семанюк Лукин, Никорак Иван, Дуцько Хомин. Но самыми зрелищными были соревнования на скочни. Сюда приезжали известные польские спортсмены Лянкуш и Марусаж, из наших ворохтян отмечались Дедерчук Макар / Цьвикив /, Бойчук Николай / Подирейськои /, Лупаций Милько. Общество «Приятели Гуцульщины» организовало соревнования ежегодно, приглашало спортсменов из Норвегии, Германии, Чехословакии, Финляндии и других стран, так что Ворохта была наполнена гостями целую зиму. В советское время построили спортбазу по лыжному спорту «Украина», а на трамплине «Авангард» - дом отдыха для спортсменов. ТУРИЗМ в Карпатах - занятие уникальное. Особенно, когда за отправную точку выбрать Ворохту. Выйдешь на горку Ясень, что на участке Шимшорив (ул.Шевченко), посмотришь вокруг - и выбирай маршрут. Отсюда видны горы Кичеру, Кукул, Костричу. Режу, Ребровач. Лысину, на севере - Магуру, Китиливку, Слепо-куру, Говерлу, Форесок, на северо-западе - Хомяк, Синяк. Горган и немало других живописных вершин. У подножия Говерлы в долине Заросляк действует одноименная туристическая база.
',
            'imgs' => '[]',
            'meta_title' => '',
            'meta_description' => '',
            'meta_keywords' => '',
            'date' => DB::raw('CURRENT_TIMESTAMP'),
            'active' => true,
		]);

        Article::create([
            'category_id' => 9,
            'name' => 'meta.main',
            'title' => 'Seo для Головної|Seo для Главной',
            'meta_title' => 'META Title|META Title RU',
            'meta_description' => 'Meta_description|META Description RU',
            'meta_keywords' => 'META Keywords, META Title, META Title1|META Keywords RU',
            'active' => true,
        ]);
        Article::create([
            'category_id' => 9,
            'name' => 'meta.goverment',
            'title' => 'Seo для Влада|Seo для Власти',
            'meta_title' => 'META Title|META Title RU',
            'meta_description' => 'Meta_description|META Description RU',
            'meta_keywords' => 'META Keywords, META Title, META Title1|META Keywords RU',
            'active' => true,
        ]);
        Article::create([
            'category_id' => 9,
            'name' => 'meta.about_us',
            'title' => 'Seo для Ворохта|Seo для Ворохта',
            'meta_title' => 'META Title|META Title RU',
            'meta_description' => 'Meta_description|META Description RU',
            'meta_keywords' => 'META Keywords, META Title, META Title1|META Keywords RU',
            'active' => true,
        ]);
        Article::create([
            'category_id' => 9,
            'name' => 'meta.tourist',
            'title' => 'Seo для Туристу|Seo для Туриста',
            'meta_title' => 'META Title|META Title RU',
            'meta_description' => 'Meta_description|META Description RU',
            'meta_keywords' => 'META Keywords, META Title, META Title1|META Keywords RU',
            'active' => true,
        ]);
        Article::create([
            'category_id' => 9,
            'name' => 'meta.gallery',
            'title' => 'Seo для Галереї|Seo для Галлереи',
            'meta_title' => 'META Title|META Title RU',
            'meta_description' => 'Meta_description|META Description RU',
            'meta_keywords' => 'META Keywords, META Title, META Title1|META Keywords RU',
            'active' => true,
        ]);
        Article::create([
            'category_id' => 9,
            'name' => 'meta.news',
            'title' => 'Seo для Новини|Seo для Новостей',
            'meta_title' => 'META Title|META Title RU',
            'meta_description' => 'Meta_description|META Description RU',
            'meta_keywords' => 'META Keywords, META Title, META Title1|META Keywords RU',
            'active' => true,
        ]);
        Article::create([
            'category_id' => 9,
            'name' => 'meta.advertising',
            'title' => 'Seo для Реклами|Seo для Реклами',
            'meta_title' => 'META Title|META Title RU',
            'meta_description' => 'Meta_description|META Description RU',
            'meta_keywords' => 'META Keywords, META Title, META Title1|META Keywords RU',
            'active' => true,
        ]);

	}

}

class CategoriesSeeder extends Seeder {

    public function run()
    {
       DB::table('Categories')->delete();

       Category::create([
            'id' => "1",
            'name' => 'Головна',
            'link' => 'main',
            'fields' => '["title","description","gallery","date","active"]',
        ]);

        Category::create([
            'id' => "2",
            'name' => 'Влада',
            'link' => 'government',
            'fields' => '["title","description","gallery","quantity","date","active"]',
        ]);

        Category::create([
            'id' => "3",
            'name' => 'Про Ворохту',
            'link' => 'about_us',
            'fields' => '["title","description","meta_title","meta_description","meta_keywords","gallery","active","price"]',
        ]);

        Category::create([
            'id' => "4",
            'name' => 'Туристу',
            'link' => 'tourist',
            'fields' => '["title","description","meta_title","meta_description","meta_keywords","gallery","date","active"]',
        ]);

        Category::create([
            'id' => "5",
            'name' => 'Фотогалерея',
            'link' => 'gallery',
            'fields' => '["title","description","gallery","date","active"]',
        ]);

        Category::create([
            'id' => "6",
            'name' => 'Слайдер',
            'link' => 'slider',
            'fields' => '["title","description","gallery","active"]',
        ]);

        Category::create([
            'id' => "7",
            'name' => 'Новини',
            'link' => 'news',
            'fields' => '["title","description","meta_title","meta_description","meta_keywords","date","active"]',
        ]);

        Category::create([
            'id' => "8",
            'name' => 'Реклама',
            'link' => 'advertising',
            'fields' => '["title","description","meta_title","gallery","meta_description","meta_keywords"]',
        ]);

        Category::create([
            'id' => "9",
            'name' => 'Seo',
            'link' => 'seo',
            'fields' => '["title","meta_title","meta_description","meta_keywords"]',
        ]);
    }

}

class LangsSeeder extends Seeder {

    public function run()
    {
        DB::table('langs')->delete();

        Lang::create([
            'lang' => 'ua',
        ]);

        Lang::create([
            'lang' => 'ru',
        ]);

        /*Lang::create([
            'lang' => 'ru',
        ]);*/

    }

}

class UsersSeeder extends Seeder {

    public function run()
    {
        DB::table('Users')->delete();

        User::create([
            'name' => 'admin',
            'email' => 'raun@i.ua',
            'password' => '$2y$10$KCR5WbIyUHXgZbsthDHHHOJgtdcmTA2Um.eXHbRwnvBWRgcJN/0O.',
        ]);

        User::create([
            'name' => 'root',
            'email' => 'webdesignstudio@gmail.com',
            'password' => '$2y$10$BdvnOe9NrHYCkipriMsBRuvfVrOGQI0oi7XzPHQSQ42pUpJGg4Q6y',
        ]);
    }

}
class TextsSeeder extends Seeder {

    public function run()
    {
        DB::table('Texts')->delete();

        Text::create([
            'page_id' => '0',
            'type' => 'input',
            'title' => 'Контактний номер телефону',
            'description' => '+380673433400',
            'priority' => '5',
        ]);

        Text::create([
            'page_id' => '0',
            'type' => 'input',
            'title' => 'Адреса',
            'description' => 'м.Ворохта, Івано-Франківська обл',
            'priority' => '5',
        ]);

        Text::create([
            'page_id' => '0',
            'type' => 'input',
            'title' => 'Пошта',
            'description' => 'exampl@gmail.com',
            'priority' => '5',
        ]);

    }

}


